Catalogs/УНСФ_СметныеРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УНСФ_СметныеРасценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

Catalogs/УНСФ_ПозицииСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УНСФ_ПозицииСмет</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.УНСФ_Смета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОД_СтарыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_СтарыйКодРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделСметы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УНСФ_СметныеРасценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УНСФ_ТипОбъемаРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаРесурсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПозицииФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>22</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УНСФ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УНСФ_СметныеРасценки/Forms/ОД_ПодборСметныхРасценокРаздел/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокОснРек = Параметры.ДокОсн;
КонецПроцедуры

&НаСервере
Процедура ВыбратьИВернутьНаСервере(Об)
	
	Для Каждого Значение из Элементы.Список.ВыделенныеСтроки Цикл
		ДобавитьПозицииСметыПоРодителю(Значение, Об);	
	КонецЦикла; 
	
	См = ДокОснРек.ПолучитьОбъект();
	См.Стоимость = Справочники.УНСФ_Смета.ПолучитьСуммуСметы(См.Ссылка);
	См.Записать();
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбратьИВернуть(Команда)
	Если ПроверитьНаГруппу(Элементы.Список.ТекущиеДанные.Ссылка) = Ложь Тогда
		Сообщить("Выбрать можно только раздел!");		
	Иначе
		ПоказатьВводЧисла(
		Новый ОписаниеОповещения("ВыполнитьВводОбъемаРабот", ЭтотОбъект),
			1,
			НСтр("ru='Введите количество для раздела'"),
			15,
			3);	
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ВыполнитьВводОбъемаРабот(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьИВернутьНаСервере(Число);
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаСервере
Функция ПроверитьНаГруппу(СсылНаСметнРасц)
	Возврат СсылНаСметнРасц.ЭтоГруппа;
КонецФункции

&НаСервере
Процедура ДобавитьПозицииСметыПоРодителю(РодительГруппа, Об)
	
	НР = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
	НР.РазделСметы = Истина; НР.Наименование = Строка(РодительГруппа);
	НР.Владелец = ДокОснРек; НР.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНСФ_СметныеРасценки.Ссылка КАК Ссылка,
		|	УНСФ_СметныеРасценки.Наименование КАК Наименование,
		|	УНСФ_СметныеРасценки.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.УНСФ_СметныеРасценки КАК УНСФ_СметныеРасценки
		|ГДЕ
		|	УНСФ_СметныеРасценки.Родитель = &ЭтотРод";

	Запрос.УстановитьПараметр("ЭтотРод", РодительГруппа);
	РезультатЗапроса = Запрос.Выполнить();	
	ВДЗ = РезультатЗапроса.Выбрать();	
	Пока ВДЗ.Следующий() Цикл
		
		СМ = 0; СР = 0;
		
		НПС = Справочники.УНСФ_ПозицииСмет.СоздатьЭлемент();
		НПС.Владелец = ДокОснРек; НПС.Наименование = ВДЗ.Наименование; НПС.Расценка = ВДЗ.Ссылка;
		НПС.Объем = Об; НПС.ЕдиницаИзмерения = ВДЗ.ЕдиницаИзмерения; 
		НПС.НаименованиеПолное = ВДЗ.Наименование; НПС.Родитель = НР.Ссылка;
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УНСФ_СметныеРасценкиРесурсы.Ссылка КАК Ссылка,
			|	УНСФ_СметныеРасценкиРесурсы.Цена КАК Цена,
			|	УНСФ_СметныеРасценкиРесурсы.Количество КАК Количество,
			|	УНСФ_СметныеРасценкиРесурсы.Ресурс КАК Ресурс
			|ИЗ
			|	Справочник.УНСФ_СметныеРасценки.Ресурсы КАК УНСФ_СметныеРасценкиРесурсы
			|ГДЕ
			|	УНСФ_СметныеРасценкиРесурсы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ВДЗ.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НС = НПС.Ресурсы.Добавить();
		
			НС.Ресурс = ВыборкаДетальныеЗаписи.Ресурс; НС.Количество = ВыборкаДетальныеЗаписи.Количество;
			НС.КоличествоВсего = ВыборкаДетальныеЗаписи.Количество * Об; НС.Цена = ВыборкаДетальныеЗаписи.Цена;
			НС.Сумма = НС.КоличествоВсего * НС.Цена; СР = СР + НС.Сумма;
		КонецЦикла; 
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УНСФ_СметныеРасценкиМатериалы.Ссылка КАК Ссылка,
			|	УНСФ_СметныеРасценкиМатериалы.Номенклатура КАК Номенклатура,
			|	УНСФ_СметныеРасценкиМатериалы.Характеристика КАК Характеристика,
			|	УНСФ_СметныеРасценкиМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	УНСФ_СметныеРасценкиМатериалы.Количество КАК Количество,
			|	УНСФ_СметныеРасценкиМатериалы.Цена КАК Цена
			|ИЗ
			|	Справочник.УНСФ_СметныеРасценки.Материалы КАК УНСФ_СметныеРасценкиМатериалы
			|ГДЕ
			|	УНСФ_СметныеРасценкиМатериалы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ВДЗ.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НС = НПС.Материалы.Добавить();
		
			НС.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; НС.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			НС.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения; НС.Количество = ВыборкаДетальныеЗаписи.Количество;
			НС.КоличествоВсего = НС.Количество * Об; НС.Цена = ВыборкаДетальныеЗаписи.Цена;
			НС.Сумма = НС.Цена * НС.КоличествоВсего; СМ = СМ + НС.Сумма;
		КонецЦикла;
		  		
		НПС.СуммаПозиции = СМ + СР;
		НПС.СуммаМатериалов = СМ;
		НПС.СуммаРесурсов = СР;
		
		НПС.Записать();		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Возврат;
КонецПроцедуры
